queueOS-backend/load-test.yaml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 50
      name: "Sustained load"
  processor: "./scripts/artillery-processor.js"

scenarios:
  - name: "Login, get queue, join queue"
    engine: "http"
    flow:
      - function: "setupTestData"
      
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "token"
            
      - get:
          url: "/api/queue/current/{{ businessId }}/{{ serviceId }}"
          headers:
            Authorization: "Bearer {{ token }}"
            
      - post:
          url: "/api/queue/token"
          json:
            businessId: "{{ businessId }}"
            serviceId: "{{ serviceId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          # Capture token ID in case we want to cancel it later
          capture:
            - json: "$.data._id"
              as: "tokenId"
              
      # Optional: cancel the token to prevent DB from blowing up infinitely during load testing
      - put:
          url: "/api/queue/cancel/{{ tokenId }}"
          headers:
            Cookie: "{{ cookie }}"
          ifTrue: "tokenId"